In [9]:
k = [4,6,2.56789,9,87.9999,40]
k

[4, 6, 2.56789, 9, 87.9999, 40]

In [7]:
import pandas as pd
import numpy as np
import seaborn as sns

In [10]:
pd.Series(k)

0     4.00000
1     6.00000
2     2.56789
3     9.00000
4    87.99990
5    40.00000
dtype: float64

In [11]:
a = np.random.randint(20,50,(5,4))

In [12]:
a

array([[44, 30, 49, 25],
       [40, 42, 29, 48],
       [28, 48, 20, 43],
       [49, 29, 28, 41],
       [46, 47, 28, 24]])

In [13]:
a.ndim

2

In [14]:
a.shape

(5, 4)

In [25]:
np.random.seed(34)
b=np.random.randint(100,200,(6,5))

In [28]:
b

array([[133, 185, 168, 135, 169],
       [111, 178, 129, 118, 129],
       [189, 129, 120, 196, 162],
       [105, 120, 151, 119, 185],
       [121, 163, 172, 142, 184],
       [172, 177, 136, 102, 137]])

In [27]:
b.ndim

2

In [22]:
b.shape

(6, 5)

In [31]:
df=pd.DataFrame(b)
df

     0    1    2    3    4
0  133  185  168  135  169
1  111  178  129  118  129
2  189  129  120  196  162
3  105  120  151  119  185
4  121  163  172  142  184
5  172  177  136  102  137

In [35]:
df=pd.DataFrame(b,columns=['Roll','name','age','adds','country'],index=[182,183,185,186,187,188])

In [36]:
df

     Roll  name  age  adds  country
182   133   185  168   135      169
183   111   178  129   118      129
185   189   129  120   196      162
186   105   120  151   119      185
187   121   163  172   142      184
188   172   177  136   102      137

In [40]:
df.iloc[0]

Roll       133
name       185
age        168
adds       135
country    169
Name: 182, dtype: int32

In [41]:
df.loc[182]

Roll       133
name       185
age        168
adds       135
country    169
Name: 182, dtype: int32

In [43]:
df.iloc[[2,4]]

     Roll  name  age  adds  country
185   189   129  120   196      162
187   121   163  172   142      184

In [44]:
df.age

182    168
183    129
185    120
186    151
187    172
188    136
Name: age, dtype: int32

In [45]:
df[['age','name']]

     age  name
182  168   185
183  129   178
185  120   129
186  151   120
187  172   163
188  136   177

In [47]:
df.loc[[182,185,186],['age','name','country']]

     age  name  country
182  168   185      169
185  120   129      162
186  151   120      185

In [48]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic',
 'anagrams',
 'anagrams',
 'anscombe',
 'anscombe',
 'attention',
 'attention',
 'brain_networks',
 'brain_networks',
 'car_crashes',
 'car_crashes',
 'diamonds',
 'diamonds',
 'dots',
 'dots',
 'dowjones',
 'dowjones',
 'exercise',
 'exercise',
 'flights',
 'flights',
 'fmri',
 'fmri',
 'geyser',
 'geyser',
 'glue',
 'glue',
 'healthexp',
 'healthexp',
 'iris',
 'iris',
 'mpg',
 'mpg',
 'penguins',
 'penguins',
 'planets',
 'planets',
 'seaice',
 'seaice',
 'taxis',
 'taxis',
 'tips',
 'tips',
 'titanic',
 'titanic',
 'anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [49]:
sns.load_dataset('glue')

          Model  Year      Encoder  Task  Score
0         ERNIE  2019  Transformer  CoLA   75.5
1            T5  2019  Transformer  CoLA   71.6
2       RoBERTa  2019  Transformer  CoLA   67.8
3          BERT  2018  Transformer  CoLA   60.5
4   BiLSTM+ELMo  2018         LSTM  CoLA   32.1
..          ...   ...          ...   ...    ...
59         BERT  2018  Transformer   RTE   70.1
60  BiLSTM+ELMo  2018         LSTM   RTE   57.4
61  BiLSTM+CoVe  2017         LSTM   RTE   52.7
62  BiLSTM+Attn  2017         LSTM   RTE   58.4
63       BiLSTM  2017         LSTM   RTE   57.4

[64 rows x 5 columns]

In [50]:
type(df)

pandas.core.frame.DataFrame

In [51]:
sns.load_dataset('titanic')

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True